<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"4dd038f231dc26aba46cc755ac4bf5ce2b180f06aa579044c36fd19c34540358","plan_job_ref":"Job Test actions using target and replace #489 at https://github.com/dflook/terraform-github-actions/actions/runs/15308636231","plan_out_hash":"713afd97d5f0e1c449d8a560936665a9707a2948fcc589a08a21fc85255986c1","plan_hash":"df7b5bc1684712154a2bb7e8edbefcd1463315d9bb5c7d3de5f7665e8a410c96","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "LKAcJSGeKI" -> (known after apply)
!~  foreach = "TAIIoIw8k3" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #489](https://github.com/dflook/terraform-github-actions/actions/runs/15308636231)